I think I hit the same issue today.

The provider version I use is 5.12.0

```
provider "registry.terraform.io/integrations/github" {
  version     = "5.12.0"
  constraints = "~> 5.0"
  hashes = [
    "h1:M4TrKADwjuTO8LKL7BNH3v8aS27sWEl4AqIlac20lRs=",
    "zh:041b44fff2004656f474cefe75ab0df27fda5163f97d774987e3b62cf6c706a0",
    "zh:0766d4cd1a43fb3f9c5f91471d26da356e1ffa222bcbc69cef7a132e0924c588",
    "zh:196c40951758fad02ea95920e46bce5cf48477723c69c5bbf09c76cb9aae989f",
    "zh:223f53cd5aace1b5ab6c9f5d1b785c740c39bf3b7244f86247bc28b4b964f9bc",
    "zh:27041c44b793993ce48c62e1679198112011afccfbb30798cf124fd45a9700c7",
    "zh:30c741f22e5fde2aad35e0fda4293da04d54fde89dbe301e702255ddcca169fa",
    "zh:51c408c0ad50726d486ebdd0eb26532645678a84cc7b38ea39a25f3a8b83a42d",
    "zh:622fdad082a0c00f827ccbd21f6a75db63bdc9ba2d49421c6603bc23c56127b0",
    "zh:648ab2f95cadac4f9e4a1eb54fad327f603ffad1e1c22769deba3c076fa6e358",
    "zh:6fd41629088abdd36d6bbdc2b56eaddcffa971a7622284d555a8c83d4b6aa210",
    "zh:8a3abc6f6fadd99963ad9a593893b724ec2c98905f66fd1f627ca3aa55191dde",
    "zh:a0653c831705804d98db9d352341fee04ea6c7db6fa612f886b7284ce8a67023",
    "zh:a9b51b0c2e5026a4676b5ac71274eaa745ebef1de72a69667855edb8a9548347",
    "zh:d7720e30f931f4069255e8d9d08332ccc2ee18b418e899fed55cd4f414f17bb6",
  ]
}
```

For a repository I enabled the project feature by setting `has_projects` to `true`

```
resource "github_repository" "azure_s3_repository_archiver" {
  name                   = "azure_s3_repository_archiver"
  allow_merge_commit     = false
  delete_branch_on_merge = true
  has_downloads          = true
  has_issues             = true
  has_projects           = true  # (was false before)
  has_wiki               = false 
  topics                 = ["aws", "cdk", "azure-devops", "s3", "backup"]
  visibility             = "public"
  vulnerability_alerts   = true
}
```

Then executed a terraform plan and apply.

As next step I setup a project resource referencing the github repository.

```
resource "github_repository_project" "azure_s3_repository_archiver" {
  name       = "Azure DevOps Git Repositories to AWS S3 archiver"
  repository = github_repository.azure_s3_repository_archiver.name
  body       = "Project Tracker for the Azure DevOps Git Repositories to AWS S3 archiver."
}
```


Terraform apply detects the changed and then the POST ends in an error

 ```
# github_repository_project.azure_s3_repository_archiver will be created
  + resource "github_repository_project" "azure_s3_repository_archiver" {
      + body       = "Project Tracker for the Azure DevOps Git Repositories to AWS S3 archiver."
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "A Repository Project"
      + repository = "azure_s3_repository_archiver"
      + url        = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
github_repository_project.azure_s3_repository_archiver: Creating...
╷
│ Error: POST https://api.github.com/repos/stefanfreitag/azure_s3_repository_archiver/projects: 410 Projects are disabled for this repository []
│ 
│   with github_repository_project.azure_s3_repository_archiver,
│   on projects.tf line 1, in resource "github_repository_project" "azure_s3_repository_archiver":
│    1: resource "github_repository_project" "azure_s3_repository_archiver" {
```

btw. : In my GitHub profile there is a section Feature Preview, here  I have "Project migration" enabled.

Checking the [GitHub API](https://docs.github.com/en/rest/projects/projects?apiVersion=2022-11-28#create-a-repository-project) gives:

> Returns a 410 Gone status if projects are disabled in the repository or if the repository does not have existing classic projects. If you do not have sufficient privileges to perform this action, a 401 Unauthorized or 410 Gone status is returned.

I disabled the feature preview and still ran into the issue.